Step_3_scripts_and_AMR/small_jet_AMR/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#includeFunc fieldAverage(U, p_rgh, prime2Mean = yes)
#includeFunc scalarTransport(s)

    residuals
{
    type            residuals;

    libs            ("libutilityFunctionObjects.so");

    writeControl    timeStep;
    writeInterval   10;
    fields
    (
        U
        p_rgh
        k
        h
        s
    );
}

// ************************************************************************* //

